Tekla Open API Reference for Tekla Structures 2025
DetailMark.DetailMarkAttributes.BoundaryShape Property
 The detail mark boundary shape.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailMark.DetailMarkAttributes.DetailBoundaryShape BoundaryShape { get; set; }
Public Property BoundaryShape As DetailMark.DetailMarkAttributes.DetailBoundaryShape
	Get
	Set
Property Value
Type: DetailMark.DetailMarkAttributes.DetailBoundaryShape
See Also
Reference
DetailMark.DetailMarkAttributes Class
Tekla.Structures.Drawing Namespace